Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh94-v2.tmx
Source language: bo
Languages: en

source: རྣམ་པར་ཐར་པས་ངེས་པར་བྱུང་བའི་བསམ་གཏན་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་ནོ། །
en: Concentration is concentration that brings emancipation through the liberations.

source: ལྷག་མཐོང་གི་ཡོ་བྱད་ཞི་གནས་ཀྱི་ས་ལ་གནས་པ་གཟུངས་ཀྱིས་ཡོངས་སུ་སྦྱང་བ་བྱས་པའི་ཤེས་རབ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་སྟེ།
en: Insight is insight that possesses the asset of special insight, rests upon the ground of calm abiding, and is trained by means of retention.

source: འདི་དག་ནི་མངོན་པར་ཤེས་པ་རྒྱུན་ཆད་པ་མེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of uninterrupted superknowledge.

source: དེ་ལ་ལུས་འདོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of wishing for a body?

source: སོ་སོར་བརྟགས་པའི་སྟོབས་ཅན་མི་མཛའ་བ་རྣམས་ལ་ཡོངས་སུ་གཏོང་བའི་སྦྱིན་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའོ། །
en: Generosity is generosity that is endowed with the power of analysis that gives liberally to enemies.

source: ཉམ་ཆུང་བ་རྣམས་ལ་མཐུ་མི་སྟོན་པས་ཉམས་པ་མེད་པའི་ཚུལ་ཁྲིམས་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་སོ། །
en: Discipline is the unfailing discipline of not showing force toward the weak.

source: ལས་ཀྱི་སྒྲིབ་པ་ལ་ཇི་མི་སྙམ་པའི་བཟོད་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའོ། །
en: Patience is the undaunted acceptance of karmic obscurations.

source: མི་མཛའ་བ་སྤངས་པའི་བརྩོན་འགྲུས་ནི་དཔེར་ན་རྒྱལ་པོའི་བུ་དགེ་བའི་བློ་གྲོས་ཀྱི་ལྟ་བུ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་སོ། །
en: Diligence is the diligence that relinquishes animosity, as exemplified by the prince Virtuous Intelligence.

source: སྙིགས་མའི་དུས་ཀྱི་བསམ་གཏན་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་ནོ། །
en: Concentration is the concentration of the age of degeneration.

source: ཐར་པ་ལ་གནས་པས་ངེས་པར་འཁོར་བར་བྱ་བར་སྦྱོར་དུ་འཇུག་པའི་ཤེས་རབ་ནི་དཔེར་ན་ཀུན་ཏུ་རྒྱུ་རྟོགས་བྱེད་ཀྱི་ལྟ་བུ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་སྟེ།
en: Insight is the insight that abides in liberation and thereby engages in saṃsāra, as exemplified by wandering mendicant Realizer.

source: འདི་དག་ནི་ལུས་འདོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of wishing for a body.

source: འཁོར་བར་ངན་སོང་གསུམ་གྱི་ཕྱིར་སྦྱིན་པ་ནི་དཔེར་ན་རི་དགས་ལ་རྔོན་པ་བྱེད་པའི་རྣམ་པར་སྨིན་པའི་སྦྱིན་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའོ། །
en: Generosity is giving for the sake of those in the lower realms of saṃsāra as exemplified by the gift of reprieve extended to a deer by a hunter.

source: སངས་རྒྱས་འབྱུང་བ་དང་བྲལ་བའི་ཚུལ་ཁྲིམས་ནི་དཔེར་ན་ལྷ་ཆེན་པོས་གཅིག་ནས་གཅིག་ཏུ་བསྟན་པ་ལྟ་བུ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་སོ། །
en: Discipline is discipline when no buddha has appeared, as exemplified by the discipline taught by one Mahādeva to another.

source: བརྙས་པས་སྡུག་བསྔལ་བར་གྱུར་ཀྱང་འཁྲུག་པ་མེད་པའི་བཟོད་པ་ནི་དཔེར་ན་བཟོད་པར་སྨྲ་བའི་ལྟ་བུ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའོ། །
en: Patience is unperturbed patience in the face of painful scorn, as exemplified by Kṣāntivādin.

source: ཚེགས་ཆེན་པོའི་གནས་སྐབས་ཐོབ་པས་སྒྱིད་ལུག་པ་མེད་པའི་བརྩོན་འགྲུས་ནི་དཔེར་ན་རྒྱ་མཚོ་ཆེན་པོར་ནོར་བུ་རིན་པོ་ཆེ་ལྟ་བུ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་སོ། །
en: Diligence is diligence without becoming disheartened even during great trials, as exemplified by searching for precious jewels in the ocean.

source: བཙུན་མོའི་འཁོར་གྱིས་མི་འཕྲོགས་པའི་བསམ་གཏན་ནི་དཔེར་ན་རྒྱལ་པོ་གཞོན་ནུ་སེང་གེའི་ལྟ་བུ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་ནོ། །
en: Concentration is concentration that cannot be disturbed by a retinue of queens, as exemplified by the king Youthful Lion.

source: ཡུལ་གྱི་ནང་དུ་སོང་ཡང་ཡོངས་སུ་གཏོང་བ་ཐམས་ཅད་ལ་དམིགས་པའི་ཤེས་རབ་ནི་དཔེར་ན་ཡུལ་ཀ་ཤིའི་རྒྱལ་པོས་མགོ་བྱིན་པ་ལྟ་བུ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་སྟེ།
en: Insight is insight that aims to relinquish everything, even as one proceeds into the realm, as exemplified by the King of Kāśī who gave away his own head.

source: འདི་དག་ནི་གནས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ །
en: Such are the six perfections of abiding.

source: དེ་ལ་ལྡན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of endowment?

source: སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་སྦྱིན་པ་ནི་དཔེར་ན་རྒྱ་མཚོ་ཆེན་པོའི་རུ་སྦལ་ལྟ་བུ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའོ། །
en: Generosity is giving for the sake of ripening sentient beings, as exemplified by the turtle in the ocean.

source: གཞན་ལ་ཕན་པར་བརྩོན་པའི་ཚུལ་ཁྲིམས་ནི་དཔེར་ན་འགྲོན་པ་རྣམས་སྦྲུལ་ཆེན་པོས་བསྐོར་བ་ལས་སེང་གེས་ཐར་བར་བྱས་པ་ལྟ་བུ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་སོ། །
en: Discipline is the discipline of endeavoring to benefit others, as exemplified by the lion who rescued the travelers who were surrounded by a great snake.

source: མཉན་པའི་ཕྱིར་བཟོད་པ་ནི་དཔེར་ན་དྲང་སྲོང་ལྷའི་རྒྱལ་པོས་ཚིགས་སུ་བཅད་པའི་ཕྱིར་མགོ་ཡོངས་སུ་བཏང་བ་ལྟ་བུ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའོ། །
en: Patience is patience for the sake of hearing the teaching, as exemplified by the sage Divine Ruler who offered his own head for the sake of a single stanza.

source: བྲམ་ཟེའི་ཁྱེའུ་ཡིས་དོན་ཇི་ལྟ་བ་བཞིན་དུ་བསམས་པའི་རེག་པ་ལྔ་སྤང་བའི་ཕྱིར་གནས་ཤིང་གཞན་ལ་བརྩེ་བར་ཡོངས་སུ་བསྔོས་པའི་བརྩོན་འགྲུས་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་སོ། །
en: Diligence is the diligence demonstrated by the brahmin boy who practiced relinquishing the five types of contact by means of correct contemplation and dedicated this practice with love for others.

source: བསམ་གཏན་ནི་དཔེར་ན་མུ་སྟེགས་བྱེད་རྩིབས་ཀྱི་མུ་ཁྱུད་བྱུང་བ་གཞན་ལ་སྙིང་བརྩེ་བ་དང་ལྡན་པ་ལྟ་བུ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་ནོ། །
en: Concentration is the presence of a loving heart toward others, as exemplified by the non-Buddhist Araṇemi.

source: སྐྱེ་བོ་མང་པོ་ཡོངས་སུ་སྨིན་པར་བྱེད་པའི་ཤེས་རབ་ནི་དཔེར་ན་སྲེག་པའི་སྐྱེས་པའི་རབས་ཀྱི་ལྟ་བུ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་སྟེ། །
en: Insight is insight that ripens many beings, as exemplified by the Bodhisattva’s life as a quail.

source: འདི་དག་ནི་ལྡན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of endowment.

source: དེ་ལ་རྣམ་པར་སྨིན་པ་མང་པོའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of myriad forms of ripening?

source: འཇིག་རྟེན་ལ་ཕན་པར་བྱ་བའི་སྦྱིན་པ་ནི་དཔེར་ན་འབེལ་མའི་ལྟ་བུ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའོ། །
en: Generosity is generosity for the sake of benefiting the world, as exemplified by Abundant.

source: ཚངས་པའི་འཇིག་རྟེན་ལ་གནས་ཏེ་འཛམ་བུའི་གླིང་གི་མི་རྣམས་ལས་བྱ་བ་ལ་འཇུག་པར་བྱེད་པའི་ཚུལ་ཁྲིམས་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་སོ། །
en: Discipline is the discipline of residing in the Realm of Brahmā while carrying out activity among the humans of Jambudvīpa.

source: སེམས་ཅན་གྱི་ཕྱིར་བདག་ཡོངས་སུ་གཏོང་བའི་བཟོད་པ་ནི་དཔེར་ན་རྒྱ་མཚོ་ནི་ཤི་བའི་རོ་དང་མི་གནས་པས་སེམས་ཅན་རྣམས་དགྲོལ་བའི་དོན་དུ་རྒྱ་མཚོ་ཆེན་པོར་བདག་ཉིད་ཡོངས་སུ་གཏོང་བ་ལྟ་བུ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའོ། །
en: Patience is the patience of sacrificing oneself for the sake of sentient beings. For example, this is like the Bodhisattva who, knowing that a corpse does not last in the ocean, sacrificed himself in the ocean in order to liberate sentient beings.

source: སྐྱེ་བོ་མང་པོ་ཡོངས་སུ་སྨིན་པར་འགྱུར་བའི་བརྩོན་འགྲུས་ནི་དཔེར་ན་རྒྱ་མཚོར་དེད་དཔོན་བསོད་ནམས་ཁྱིམ་ལག་རྐྱལ་གྱིས་རྒལ་བ་ལས་རིག་པར་བྱ་བ་ལྟ་བུ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་སོ། །
en: Diligence is diligence that ripens many beings. This can be understood from the example of the captain Home of Merit, who swam across the ocean.

source: གཞན་ལ་ཕན་པར་ཡོངས་སུ་བསྔོས་པའི་བསམ་གཏན་ནི་དཔེར་ན་བྲམ་ཟེའི་བུ་ནོར་གྱི་བློ་གྲོས་ཀྱིས་སེམས་ཅན་རྣམས་བདེ་བ་ལ་སྦྱར་བའི་ཕྱིར་ལོ་སྟོང་ཕྲག་བརྒྱད་ཅུར་བྱམས་པ་བསྒོམས་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་ནོ། །
en: Concentration is concentration dedicated to benefiting others, as exemplified by the young brahmin Jewel Intelligence, who practiced the cultivation of love for eighty thousand years in order to bring happiness to sentient beings.

source: འཇིག་རྟེན་པ་དང་འཇིག་རྟེན་ལས་འདས་པའི་ཆོས་རྣམས་ལས་ཤིན་ཏུ་རྣམ་པར་གདོན་མི་ཟ་བའི་ཤེས་རབ་ནི་དཔེར་ན་རྒྱལ་པོ་བློ་བཟངས་ཀྱིས་སྔོན་གྱི་ཚུལ་ཤིང་ལོང་ལས་རིག་པར་བྱ་བ་ལྟ་བུ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་སྟེ།
en: Insight is insight that does not harbor any doubts concerning mundane or supramundane phenomena. This can be understood from the past example of King Subuddhi.

source: འདི་དག་ནི་རྣམ་པར་སྨིན་པ་མང་པོའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of myriad forms of ripening.

source: ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའི་སྦྱིན་པའི་རྣམ་པར་སྨིན་པ་མི་ལྡོག་པ་ནི་དཔེར་ན་རྒྱལ་རིགས་ཀྱིས་ཆུ་བོ་གང་གཱར་དེ་ལ་སོགས་པའི་སྦྱིན་པའི་ལྟ་བུ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའོ། །
en: Generosity is the gift of parinirvāṇa that has ripened irreversibly, as exemplified by the kṣatriya’s generosity near the river Gaṅgā.

source: བཏང་སྙོམས་ཡོངས་སུ་བཟུང་ཞིང་ཕྱིར་མི་ལྡོག་པ་ཟག་པ་ཟད་པའི་ཚུལ་ཁྲིམས་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་སོ། །
en: Discipline is the discipline that comprehends equanimity and irreversibly brings contaminants to exhaustion.

source: བྱང་ཆུབ་ཐོབ་པའི་བཟོད་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའོ། །
en: Patience is the patience of attaining awakening.

source: ལུས་ཀྱི་འདུ་བྱེད་འདོར་བའི་བརྩོན་འགྲུས་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་སོ། །
en: Diligence is diligence that gives up formations associated with the body.

source: ཆོས་ལ་བཏང་སྙོམས་པས་རབ་ཏུ་ཕྱེ་བས་བྱང་ཆུབ་ཀྱི་སྙིང་པོར་སྐྱོ་བ་མེད་པའི་བསམ་གཏན་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་ནོ། །
en: Concentration is concentration that is distinguished by impartiality regarding phenomena and remains free from weariness right up to the seat of awakening.

source: བྱང་ཆུབ་ཀྱི་ཡེ་ཤེས་སྟོན་པས་ཤེས་རབ་ཀྱིས་རབ་ཏུ་བཟུང་བ་ནི་དཔེར་ན་བྲམ་ཟེའི་བུ་བྱིས་པ་དཔེར་བརྗོད་པ་ལྟ་བུ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་སྟེ།
en: Insight is to uphold insight by teaching the wisdom of awakening, as exemplified by the brahmin youth Infant in his use of examples.

source: འདི་དག་ནི་རྣམ་པར་སྨིན་པ་མེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections beyond ripening.

source: མྱ་ངན་ལས་འདས་པའི་སྦྱིན་པ་ནི་དཔེར་ན་དགའ་བའི་སྔོན་གྱི་ཚུལ་ལས་ཤེས་པར་བྱ་བ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའོ། །
en: Generosity is the generosity of nirvāṇa, as can be learned from the account of Nanda.

source: འདུས་བྱས་ཀྱིས་ཡིད་བྱུང་ཞིང་མྱ་ངན་ལས་འདས་པའི་བསམ་པ་ཅན་གྱི་ཚུལ་ཁྲིམས་ནི་དཔེར་ན་བྱང་ཆུབ་སེམས་དཔའ་བརྩོན་འགྲུས་ལ་སྤྱོད་པའི་སྔོན་གྱི་ཚུལ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་སོ། །
en: Discipline is the discipline of someone weary of conditioned things and intent on nirvāṇa.

source: ཆགས་པ་མེད་པའི་བཟོད་པ་ནི་དཔེར་ན་ཡུལ་ཀ་ཤིའི་རྒྱལ་པོའི་མགོ་བཅད་ཀྱང་འཁྲུག་པ་མེད་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའོ། །
en: Patience is the patience of detachment, as exemplified by the King of Kāśī, who let his own head be cut off without distress.

source: སེར་སྐྱའི་གནས་ནས་བྱུང་སྟེ། བསོད་སྙོམས་ལེན་པའི་བརྩོན་འགྲུས་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་སོ། །
en: Diligence is the diligence of leaving Kapilavastu and embracing the life of a mendicant.

source: ཚངས་པར་སྤྱོད་ཅིང་ཡན་ལག་བཞི་དང་ལྡན་པ་སྤུ་ཟིང་ཞེས་བྱེད་པའི་བསམ་གཏན་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་ནོ། །
en: Concentration is the so-called ‘thrilling’ concentration of practicing pure conduct endowed with the four aspects.

source: གྲོང་ཁྱེར་དང་མཚུངས་པའི་ཤེས་རབ་ནི་དཔེར་ན་འཇིག་རྟེན་པ་མ་ལུས་པ་ཐམས་ཅད་སྙོམས་པར་ཞུགས་པ་ལྟ་བུ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་སྟེ།
en: Insight is insight that resembles a city. For example, it is like the entire world entering equanimity.

source: དེ་ལ་དུས་སུ་བྱིན་པ་དང་མཚུངས་པར་ལྡན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections associated with timely generosity?

source: སྡུག་བསྔལ་བར་འགྱུར་བ་རྣམས་ལ་སྦྱིན་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའོ། །
en: Generosity is giving to those who suffer.

source: རུ་སྦལ་གྱི་སྐྱེས་པའི་རབས་ཀྱི་ཚུལ་ཁྲིམས་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་སོ། །
en: Discipline is the discipline shown by the Bodhisattva in his former life as a turtle.

source: མངོན་དུ་སྡུག་བསྔལ་བས་ལུས་དང་ངག་ལ་གནོད་པ་མེད་པའི་བཟོད་པ་ནི་དཔེར་ན་བཟང་བརྩམས་ཡན་ལག་བཅད་ཀྱང་འཁྲུག་པ་མེད་པའི་བཟོད་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའོ། །
en: Patience is the patience that renders body and speech unaffected by suffering, as exemplified by Excellent Endeavor, who remained unperturbed even as his limbs were severed.

source: སངས་རྒྱས་འབྱུང་བ་ན་བརྩོན་པ་ནི་དཔེར་ན་སངས་རྒྱས་མངོན་སུམ་དུ་བྱེད་ཅིང་དེ་བཞིན་གཤེགས་པའི་ཏིང་ངེ་འཛིན་རྒྱ་མཚོ་ལ་ལོ་སུམ་ཁྲིའི་བར་དུ་རྨུགས་པ་དང་གཉིད་མི་འབྱུང་བ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་སོ། །
en: Diligence is diligence when a buddha manifests. For example, it is like gaining the realization of a buddha and remaining for thirty thousand years in an ocean of a thus-gone one’s absorptions free from dullness and sleepiness.

source: བཙུན་མོའི་འཁོར་ན་གནས་པའི་བསམ་གཏན་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་ནོ། །
en: Concentration is the concentration that is associated with dwelling within the retinue of queens.

source: འཁོར་བ་ན་གང་དུས་དང་མཚུངས་པར་ལྡན་པའི་ཤེས་རབ་གང་དང་གང་དུ་བདག་དང་གཞན་ལ་ཕན་པར་འགྱུར་བའི་ཤེས་རབ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་སྟེ།
en: Insight is timely insight while one is in saṃsāra that thereby benefits both oneself and others as appropriate.

source: འདི་དག་ནི་དུས་སུ་སྦྱིན་པ་དང་མཚུངས་པར་ལྡན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ །
en: Such are the six perfections associated with timely generosity.

source: དེ་ལ་འོད་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of light?

source: མར་མེའི་ཕྲེང་བ་སྦྱིན་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའོ། །
en: Generosity is the giving of garlands of lamps.

source: གཞན་ལ་ཕན་པའི་ཚུལ་ཁྲིམས་ནི་དཔེར་ན་སྲེག་པའི་སྐྱེས་པའི་རབས་ལྟ་བུ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་སོ། །
en: Discipline is a discipline that benefits others, as exemplified by the Bodhisattva’s life as a quail.

source: ཆོས་ལ་ངེས་པར་རྟོགས་པའི་བཟོད་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའོ། །
en: Patience is the patience of comprehending the Dharma.

source: འབྲུ་མར་གྱི་སྦྱིན་པ་ལ་བརྩོན་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་སོ། །
en: Diligence is the diligent giving of oil from seeds.

source: བྱང་ཆུབ་སེམས་དཔའི་བསྐལ་པ་དང་པོ་པའི་བསམ་གཏན་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་ནོ། །
en: Concentration is the concentration of the Bodhisattva’s first eon.

source: ཆོས་ལ་བཟོད་པ་ལས་ངེས་པར་བྱུང་བའི་ཤེས་རབ་ནི་དཔེར་ན་བྲམ་ཟེའི་བུ་སྤྲིན་གྱི་ལྟ་བུ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་སྟེ།
en: Insight is the insight of deliverance that arises from acceptance of the Dharma as exemplified by the brahmin youth Megha.

source: འདི་དག་ནི་འོད་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of light.

source: དེ་ལ་འོད་མཐའ་ཡས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of limitless light?

source: ཐབས་ལ་མཁས་པའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གི་རྣམ་པར་སྨིན་པས་སངས་རྒྱས་ཀྱི་ཞིང་མཐའ་ཡས་པར་སངས་རྒྱས་ཀྱི་འོད་ཀྱིས་འགེངས་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའོ། །
en: Generosity is the sixfold perfection of generosity based on skillful means, ripening to fill limitless buddha realms with buddha light.

source: མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་པས་ཡོངས་སུ་བསྔོ་བའི་ཚུལ་ཁྲིམས་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་སོ། །
en: Discipline is discipline dedicated through the acceptance that phenomena are nonarising.

source: ཆོས་ལ་འདུ་ཤེས་པའི་བཟོད་པ་ཡོངས་སུ་བསྔོ་བ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའོ། །
en: Patience is the acceptance that is dedicated to conceptions of the Dharma.

source: སྟོང་པ་ཉིད་ལ་སྒོམ་པར་དགའ་བའི་བརྩོན་འགྲུས་ཡོངས་སུ་བསྔོ་བ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་སོ། །
en: Diligence is diligence dedicated to delighting in meditating on emptiness.

source: ཕྱིར་མི་ལྡོག་པའི་བསམ་གཏན་ཡོངས་སུ་བསྔོ་བ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་ནོ། །
en: Concentration is the dedication to concentration that is irreversible.

source: ས་བརྒྱད་པ་ལ་གནས་པའི་ཤེས་རབ་ཐམས་ཅད་དུ་ཡོངས་སུ་བསྔོ་བ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་སྟེ།
en: Insight is the insight that dwells upon the eighth spiritual level, which is universally dedicated.

source: འདི་དག་ནི་འོད་མཐའ་ཡས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of limitless light.

source: དེ་ལ་རྣམ་པར་སྨིན་པ་བདེ་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of delightful ripening?

source: ཤི་བ་ལ་ཐུག་པའི་སྦྱིན་པ་གང་གི་རྣམ་པར་སྨིན་པས་དགའ་ལྡན་ནས་ཤི་འཕོས་པ་ན་ཡི་དགས་རྣམས་ཀྱི་བཀྲེས་པ་ཕྱིད་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའོ། །
en: Generosity is generosity at the time of death, which ripens so that the hunger of starving spirits is alleviated as one transfers upon death from the Heaven of Joy.

source: ཤི་བ་ལ་ཐུག་པ་རྣམས་བཅིངས་པ་ལས་དགྲོལ་བའི་ཕྱིར་བདག་ཉིད་གཏོང་བའི་ཚུལ་ཁྲིམས་ནི་དཔེར་ན་རྒྱལ་པོའི་བུ་ལེགས་བྱིན་གྱི་སྔོན་གྱི་ཚུལ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་སོ། །
en: Discipline is the discipline of freeing those at the verge of death from bondage, as exemplified in the past by Prince Sudatta.

source: བཟོད་པ་ནི་དཔེར་ན་ཉའི་སྐྱེས་པའི་རབས་ལས་གྲོག་སྦུར་དེ་དག་གིས་བདག་གི་ཤ་ཟོས་ནས་བདེ་བར་གྱུར་ན་ལེགས་སོ་ཞེས་བྱ་བ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའོ། །
en: Patience is patience of the kind exemplified in the Bodhisattva’s life as a fish. He thought, ‘If the ants thrive from eating my flesh, so be it!’

source: རྟའི་རྒྱལ་པོ་རྔོག་ལྡན་སྡུག་བསྔལ་བ་རྣམས་ལ་སྙིང་བརྩེ་བའི་ཕྱིར་བརྩོན་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་སོ། །
en: Diligence is the diligence of having loving affection for those who suffer, as exemplified by Keśin, king of horses.

source: ནད་ཀྱི་བར་གྱི་བསྐལ་པའི་བསམ་གཏན་ནི་དཔེར་ན་བྲམ་ཟེའི་བུ་དེ་བི་དྷ་འཛམ་བུའི་གླིང་དུ་རེག་པ་ལྔ་ཞི་བར་བྱེད་པ་ལྟ་བུ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་ནོ། །
en: Concentration is concentration during an intermediate eon of disease, as exemplified by the brahmin youth Vidha, who quelled the five types of sensory contact in Jambudvīpa.

source: ཚོང་པ་ལྔ་བརྒྱ་དང་རྒྱལ་པོའི་སྲས་མོ་བུ་མོ་ལྔ་བརྒྱ་དག་ཐར་བར་བྱས་པ་དང་། སྲིན་མོ་བྱེ་བ་ཕྲག་ལྔ་མིར་བྱས་པའི་ཤེས་རབ་ནི་དེད་དཔོན་གྱི་སྔོན་གྱི་ཚུལ་ལས་ཤེས་པར་བྱ་བ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་སྟེ།
en: Insight is the insight demonstrated in the Bodhisattva’s life as a captain who liberated five hundred merchants and five hundred princesses, and turned fifty million rākṣasīs into humans.

source: འདི་དག་ནི་རྣམ་པར་སྨིན་པ་བདེ་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of delightful ripening.

source: ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་ལ་རེ་བ་མེད་ཅིང་མི་དམིགས་པས་བླ་ན་མེད་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོས་པའི་སྦྱིན་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའོ། །
en: Generosity is the generosity that places no hopes in, and does not focus on, the vehicles of hearers or solitary buddhas, but is instead dedicated to unsurpassable awakening.

source: མི་བལྟ་བའི་ཚུལ་ཁྲིམས་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་སོ། །
en: Discipline is discipline free from views.

source: དེའི་ངོ་བོ་མ་ཡིན་པའི་བཟོད་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའོ། །
en: Patience is acceptance of the lack of essence.

source: ཐབས་མཁས་པའི་བརྩོན་འགྲུས་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་སོ། །
en: Diligence is diligence endowed with skillful means.

source: རིག་པ་སྐྱེད་པའི་བསམ་གཏན་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་ནོ། །
en: Concentration is concentration that engenders knowledge.

source: མཉམ་པ་ཉིད་ཀྱི་སའི་ཤེས་རབ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་སྟེ།
en: Insight is the insight present upon the level of equality.

source: དེ་ལ་དགའ་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of delight?

source: སངས་རྒྱས་འབྱུང་བ་ན་སེམས་ཅན་ཐམས་ཅད་ལ་སྦྱིན་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའོ། །
en: Generosity is generosity toward all sentient beings when a buddha appears.

source: སངས་རྒྱས་འབྱུང་བའི་དུས་སུ་རྣམ་པར་སྨིན་པའི་ཚུལ་ཁྲིམས་ནི་དཔེར་ན་གཞོན་ནུ་དཔལ་མཐུའི་སྔོན་གྱི་ཚུལ་ལྟ་བུའོ། །
en: Discipline is the discipline that ripens when a buddha appears, as exemplified in the past by the youth Glorious Power.

source: བཟོད་པ་ནི་དཔེར་ན་རྒྱལ་པོ་བསོད་ནམས་རྒྱ་ཆེན་གྱིས་བདག་འབའ་ཞིག་བདེ་བར་མ་གྱུར་ཅིག །བདག་ཀྱང་བདེ་བར་གྱུར་ལ་གང་གཞན་ཡང་བདེ་བར་གྱུར་ཅིག་ཅེས་གང་སྨྲས་པ་ལྟ་བུ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའོ། །
en: Patience is like the patience expressed by the king Vast Merit, who said, ‘May I not be the only one happy. May I and all others be happy!’

source: གཟུངས་རབ་ཏུ་ཐོབ་པར་འགྱུར་བའི་བརྩོན་འགྲུས་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་སོ། །
en: Diligence is endeavoring to obtain all teachings.

source: སེམས་ཅན་རྣམས་ཀྱི་རྣམ་པར་སྨིན་པ་བདེ་བར་ཡོངས་སུ་བསྔོས་པའི་བསམ་གཏན་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་ནོ། །
en: Concentration is concentration dedicated to a pleasant karmic ripening for sentient beings.

source: ས་བརྒྱད་པ་ཕྱིར་མི་ལྡོག་པའི་ཤེས་རབ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་སྟེ།
en: Insight is the irreversible insight upon the eighth spiritual level.

source: འདི་དག་ནི་དགའ་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of delight.

source: དེ་ལ་རྣམ་པར་དག་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of purification?

source: མངོན་པར་ཞེན་པ་མེད་པའི་སྦྱིན་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའོ། །
en: Generosity is generosity free of conceptual attachments.

source: ཤིན་ཏུ་སྦྱངས་པ་བྱང་ཆུབ་ཀྱི་ཡན་ལག་བསྒྲུབ་པའི་ཚུལ་ཁྲིམས་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་སོ། །
en: Discipline is the discipline of accomplishing the extremely purified factors of awakening.

source: ལུས་ལ་མི་ལྟ་བ་དང་། སྲོག་ལ་མི་ལྟ་བའི་བཟོད་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའོ། །
en: Patience is the patience of having no concern for life and limb.

source: ཆོས་རྣམ་པར་འབྱེད་པ་བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་མཚུངས་པར་ལྡན་པའི་བརྩོན་འགྲུས་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་སོ། །
en: Diligence is diligence associated with the factor of awakening that discerns phenomena.

source: རྟོག་པ་མེད་པའི་བསམ་གཏན་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་ནོ། །
en: Concentration is nonconceptual concentration.

source: བྱང་ཆུབ་བསྒྲུབ་པའི་ཤེས་རབ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་སྟེ།
en: Insight is the insight that accomplishes awakening.

source: འདི་དག་ནི་རྣམ་པར་དག་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of purification.

source: དེ་ལ་འཇིག་རྟེན་པའི་ཆོས་ལས་འདས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections that transcend worldly phenomena?

source: རྣམ་པར་སྨིན་པ་འདུས་མ་བྱས་དང་ལམ་བདེ་བ་སྒྲུབ་པའི་སྦྱིན་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའོ། །
en: Generosity is the generosity of unconditioned ripening that accomplishes the joyful path.

source: ལམ་ལ་ཞུགས་པའི་ཚུལ་ཁྲིམས་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་སོ། །
en: Discipline is the discipline of having embarked upon the path.

source: བྱང་ཆུབ་ལ་ཐེ་ཙོམ་མེད་པའི་བཟོད་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའོ། །
en: Patience is the patience of not having any doubts about the path.

source: མཐོང་བའི་ཆོས་ལ་བདེ་བ་སྒྲུབ་པའི་བརྩོན་འགྲུས་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་སོ། །
en: Diligence is diligence that accomplishes happiness in this life.

source: འགོག་པའི་སྙོམས་པར་འཇུག་པ་དང་མཚུངས་པར་ལྡན་པའི་བསམ་གཏན་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་ནོ། །
en: Concentration is concentration associated with the meditative attainment of cessation.

source: དྲན་པ་ཉེ་བར་གཞག་པ་ཡོངས་སུ་སྦྱང་བ་བྱས་ཤིང་། བདེན་པ་ཡོངས་སུ་བཟུང་བ་བྱ་བ་བྱས་པའི་ཤེས་རབ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་སྟེ།
en: Insight is the insight of thorough training in the applications of mindfulness and comprehension of the truths.

source: འདི་དག་ནི་འཇིག་རྟེན་པའི་ཆོས་ལས་འདས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections that transcend worldly phenomena.

source: དེ་ལ་སྐྱེ་བ་བཀོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of manifestation by birth?

source: སྐྱེས་པ་ཙམ་གྱིས་སྟོང་གསུམ་དུ་སྦྱིན་པ་སྦྱིན་པར་བྱེད་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའོ། །
en: Generosity is giving throughout a trichiliocosm simply by taking birth.

source: སྐྱེས་པ་ཙམ་གྱིས་སེམས་ཅན་ཐམས་ཅད་བདེ་བར་གྱུར་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་སོ། །
en: Discipline is the discipline of bringing all sentient beings happiness simply by taking birth.

source: སྐྱེས་པ་ཙམ་གྱིས་སེམས་ཅན་གནོད་སེམས་ཅན་རྣམས་གནོད་པར་མི་བྱེད་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའོ། །
en: Patience is the patience of causing malicious sentient beings to give up harm simply by taking birth.

source: སྐྱེས་པ་ཙམ་གྱིས་སེམས་ཅན་སྟོང་ཕྲག་རྣམས་མྱ་ངན་ལས་འདས་པ་ལ་བརྩོན་པ་ནི་དཔེར་ན་འོད་སྲུང་དང་པོར་རབ་ཏུ་བྱུང་བ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་སོ། །
en: Diligence is the endeavor to bring thousands of sentient beings to nirvāṇa simply by taking birth, as exemplified by Kāśyapa’s initial stepping forth.

source: སྐྱེས་པ་ཙམ་གྱིས་སེམས་ཅན་རྣམས་དྲན་པ་ཐོབ་པའི་བསམ་གཏན་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་ནོ། །
en: Concentration is causing sentient beings to attain recollection simply by taking birth.

source: སྐྱེས་པ་ཙམ་གྱིས་སེམས་ཅན་དམྱལ་བར་གྱུར་པ་ཆོས་བརྗོད་པ་རྣམས་ཐ་ན་ཀུན་ཏུ་བརྗོད་ཅིང་མངོན་པར་བརྗོད་པའི་ཤེས་རབ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་སྟེ།
en: Insight is the insight whereby one even teaches and explains to hell beings, who have forgotten the Dharma, simply by taking birth.

source: འདི་དག་ནི་སྐྱེ་བ་བཀོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of manifestation by birth.

source: དེ་ལ་རིགས་ཕུན་སུམ་ཚོགས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of a perfect family?

source: འཁོར་གྱི་ལོངས་སྤྱོད་ཆེན་པོའི་སྦྱིན་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའོ། །
en: Generosity is giving the vast enjoyments of the retinue.

source: འཁོར་ཁ་ན་མ་ཐོ་བ་མེད་པའི་ཚུལ་ཁྲིམས་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་སོ། །
en: Discipline is the discipline of the retinue free from unwholesome deeds.
